            *> setup the identification division
            IDENTIFICATION DIVISION.
            AUTHOR. Asher Mancinelli.
            PROGRAM-ID. LCPEAKELEMENT.
            DATA DIVISION.
              WORKING STORAGE SECTION.
            *> setup the procedure division (like 'main' function)
            PROCEDURE DIVISION.
              *> print a string
              DISPLAY 'Cobol compiler is working'.
            *> end our program
            STOP RUN.

